class RoomData(object):
    def __init__(self):
        self.rooms = {
            "death": {
                "name": "死亡",
                "info": {
                    "start": [],
                    "random_info": [
                        "你死了。",
                        "你倒在了地上。",
                        "你变成了旅途中的一具尸骨……",
                        "啊，你的一生。"
                    ],
                    "end": ["请刷新网页重来"]
                },

                "actions": {
                    "restart": {
                        "keys": ['y', 'yes', 'restart', 'start', 'kaishi', '重来', '重', '重新开始'],
                        "text": [
                            "你的灵魂消散了……渐渐地，又在什么地方凝聚了起来。",
                            "……"
                        ],
                        "next_room": "start"
                    },
                    "quit": {
                        "keys": ['n', 'no', 'quit', 'exit', "退出", "不玩"],
                        "text": [],
                        "random_text": [
                            "再会，勇者。",
                            "“你这个只会逃避的懦夫！”不知道是谁的骂声在回响……啊，但是对你来说已经不重要了。"
                        ],
                        "next_room": ""
                    }
                }
            },
            "to_be_continue": {
                "name": "待续",
                "info": {
                    "start": [
                        "未完待续……"
                    ],
                    "random_info": [

                    ],
                    "end": []
                },

                "actions": {
                    "quit": {
                        "keys": [],
                        "text": ["到目前为止，你得不错。"],
                        "random_text": [

                        ],
                        "next_room": ""
                    }
                }
            },
            "start": {
                "name": "这是一个友好的提示。",
                "info": {
                    "start": ["你真的要开始你的历险吗？"],
                    "random_info": [
                        "可能会掉san值！",
                        "这是一个不太友好的世界,",
                        "可能很危险！",
                        "请不要咬键盘，"
                    ],
                    "end": [
                        "现在放弃还来得及。"
                    ]
                },
                "actions": {
                    "default": {
                        "keys": [],
                        "text": ["好吧，既然你执意如此……"],
                        "next_room": "your_home"
                    },
                    "quit": {
                        "keys": ["不玩", "不玩了", "退出", "不了", "放弃"],
                        "text": ["明智的选择！"],
                        "next_room": ""
                    }
                }
            },
            "your_home": {
                "name": "家",
                "info": {
                    "start": [
                        "你妻子回娘家前给你做的饭已经吃完了。",
                        "然而她还没有回来。",
                        "你觉得很饿。"
                    ],
                    "random_info": [],
                    "end": []
                },

                "actions": {
                    "go to find her": {
                        "keys": ['出去找她', "找她", "去找她", "出门找她"],
                        "text": [
                                 "你带上了弓箭和一把砍刀，决定出发去找她。"
                                 ],
                        "next_room": "farm_house"
                    },
                    "wait": {
                        "keys": ['继续等', '在家', '在家等她', '等', '等一等', '等等', '搜索'],
                        "text": [
                                 "你在家里等了又等，但她始终没有回来。",
                                 "你最后唯一记得的就是无尽的饥饿感。"
                                 ],
                        "next_room": "death"
                    },
                    "cook": {
                        "keys": ['做饭', '自己做', '烧饭', '煮饭'],
                        "text": [
                                 "你决定自力更生。",
                                 "你笨手笨脚地生了火，但是一不小心引着了炉前的柴火。",
                                 "你试图灭火，但火势迅速蔓延。你没来得及逃出去。",
                                 ],
                        "next_room": "death"
                    },
                    "suiside": {
                        "keys": ['自杀'],
                        "text": [
                                 "真是明智的选择",
                                 "你点燃了自己的家",
                                 "然后还往自己脖子上补了一刀",
                                 "真是想不死都难呐",
                                 ],
                        "next_room": "death"
                    },
                    "drink": {
                        "keys": ['吃药','喝药','喝农药','喝水','喝','找饭吃','找饭','找东西吃', '找吃的'],
                        "text": [
                                 "你想了想，在自己家墙角找了瓶不知道是啥的液体",
                                 "一口喝了下去",
                                 "顿时你全身发热",
                                 "然后失去了意识",
                                 ],
                        "next_room": "death"
                    },
                    "meituan": {
                        "keys": ['外卖','叫外卖','叫饿了么','饿了么','叫美团','美团'],
                        "text": [
                                 "你摸了半天口袋，发现自己没有手机",
                                 "于是开始在全家翻箱倒柜找手机",
                                 "找了三天三夜之后你才意识到",
                                 "自己没有手机",
                                 "饥饿的你趴在地上，再也没有力气站起来了",
                                 ],
                        "next_room": "death"
                    }
                }
            },
            "farm_house": {
                "name": "农舍",
                "info": {
                    "start": [
                        "你看到了一间农舍，几只鸡咯咯地在地上找着虫子，还有一只鸡安静地坐在草窝里。",
                        "有一位美丽的姑娘坐在门口绩麻，身边有一个巨大的麻团。",
                        "“烦死了，这要做到哪年去……”美丽的姑娘恨恨地说道。"
                    ],
                    "random_info": [],
                    "end": []
                },

                "actions": {
                    "talk": {
                        "keys": ['问路', "搭讪", "说话", "说", "喊", "搭讪", "和她说话", "向她问路"],
                        "text": [
                            "她表示不知道：",
                            "“等我家的人回来了一起吃晚饭，再问他们好了。”",
                            "于是你留了下来。"
                        ],
                        "next_room": "dinner"
                    },
                    "ignore her": {
                        "keys": ['无视她', '无视', '不理', '继续走'],
                        "text": [
                            "她看上去越来越生气，随手拿起旁边短木做的凳子一扔，正好打中你的头。",
                            "你倒在地上，在她的尖叫声中，你的视野变成了红色。"
                        ],
                        "next_room": "death"
                    },
                    "make her eat it": {
                        "keys": ['要鸡蛋', '要个鸡蛋', '向她要一个鸡蛋', '向她要鸡蛋', "鸡蛋"],
                        "text": [
                            "你向她要了一个鸡蛋，塞在她的麻团里。",
                            "等她家人来后，你谎称自己是个么公，装神弄鬼了一番，将麻团扔到了火里。",
                            "砰的一声，鸡蛋炸了。",
                            "“果然有鬼！”她家人大惊失色。",
                            "她家里人感激地送了你两大包用芭蕉叶包好的糯米饭，给你指了路，送你出了门。",
                        ],
                        "next_room": "bank"
                    }
                }
            },
            "dinner": {
                "name": "晚饭",
                "info": {
                    "start": [
                        "你和美丽姑娘的父母兄弟坐在一张破旧的木桌前，每人面前是一大碗粥。",
                        "虽然你很饿了，但是你发誓从来没有见过吃饭这么快的人。"
                    ],
                    "random_info": [],
                    "end": []
                },
                "actions": {
                    "default": {
                        "keys": [],
                        "text": [
                            "不出所料，你成了最后一个吃完的人。",
                            "你看到这家人每一个人的脸上都露出了如释重负的表情。",
                            "你感觉不妙。",
                            "然后你发现自己变成了一头牛。",
                            "之后你每天都被牵去犁地，最后不堪重负而死。"
                        ],
                        "next_room": "death"
                    },
                    "quick": {
                        "keys": ['快速吃', '快吃', '快喝', '快速喝', '用最快的速度吃饭', '用最快的速度吃粥', '以最快的速度', '用最快的速度吃粥', '用最快的速度喝粥', '以最快的速度吃完', '用最快的速度喝粥', '以最快的速度吃饭', '以最快的速度吃粥', '以最快的速度喝粥'],
                        "text": [
                            "你掐住自己的脖子，倒在了地上。",
                            "这粥真的是太烫了。"
                        ],
                        "next_room": "death"
                    }
                }
            },
            "bank": {
                "name": "河边",
                "info": {
                    "start": [
                        "你沿着河边的小路一直走，来到一棵大树旁，这棵树曾经被拦腰截断，不过剩下的部分现在还活着。",
                        "你闻到一股很重的腥骚味。",
                        "你看到一只老虎，幸运的是它还没有看到你。"
                    ],
                    "random_info": [],
                    "end": []
                },
                "actions": {
                    "attack": {
                        "keys": ['用弓射', "用弓箭射", "攻击", "攻击老虎", "用刀砍", "用砍刀", "打老虎", '用弓射老虎', "用弓箭射老虎", "攻击老虎", "用刀砍老虎", "用砍刀砍老虎", "用砍刀攻击老虎", "用砍刀攻击老虎"],
                        "text": [
                            "被激怒的老虎向你扑来。",
                            "你被咬断了脖子。"
                        ],
                        "next_room": "death"
                    },
                    "default": {
                        "keys": [],
                        "text": [
                            "老虎发现了你，高兴地向你扑来。",
                            "你最后看到的场景是老虎在你的尸体上大嚼。"
                        ],
                        "next_room": "death"
                    },
                    "爬树": {
                        "keys": ['爬树', '爬到树上', '爬上树', '上树'],
                        "text": [
                            "你赶紧爬到树上。",
                            "树枝很稀疏，你只能期望自己没有被发现。"
                        ],
                        "next_room": "on_the_tree"
                    }
                }
            },
            "on_the_tree": {
                "name": "在树上",
                "info": {
                    "start": [
                        "老虎来到了你所在的这棵树下，趴到河边开始喝水。",
                        "它从水中的倒影里看到了你。",
                        "它伸爪到水中捞了半天，但是什么也捞不到。",
                        "你忍不住笑出声……你被发现了！",
                        "老虎怒吼着跳起来，差一点就能够到你。你想往上爬，但是已经到顶了。",
                        "老虎在不断地往上跳，试图抓住你。"
                    ],
                    "random_info": [],
                    "end": []
                },
                "actions": {
                    "default": {
                        "keys": [],
                        "text": [
                            "你被老虎的爪子勾到了裤子，从树上摔落下来。",
                            "你脑子里想到的最后一件事是摔死和被咬死之间的区别究竟在哪里。"
                        ],
                        "next_room": "death"
                    },
                    "chop": {
                        "keys": ['用刀砍', "砍", "刀砍", "砍刀", "砍老虎"],
                        "text": [
                            "你抽出砍刀，在老虎又一次起跳的时候照准它的头砍了一刀。",
                            "老虎怒吼一声，落在地上。"
                        ],
                        "next_room": "after_3_days"
                    },
                    "shoot": {
                        "keys": ['射老虎', '用弓箭', '用箭射', '射', '射死老虎'],
                        "text": [
                            "在慌乱中你失去平衡，一头摔下了树。"
                        ],
                        "next_room": "'death"
                    }
                }
            },
            "after_3_days": {
                "name": "在树上的三天后",
                "info": {
                    "start": [
                        "你在树上战战兢兢地过了三天，不知道老虎到底死了没有。",
                        "虽然老虎一直都没有动，但是你也不敢下树。",
                        "你正准备吃掉最后一小团米饭的时候，飞来了一只非常烦人的苍蝇。",
                        "苍蝇：“嘤嘤嘤嘤……",
                        "“嘤嘤嘤嘤……",
                        "“嘤嘤嘤嘤嘤嘤嘤嘤嘤嘤嘤嘤嘤……",
                        "“把你的米饭分我一点，",
                        "“嘤嘤嘤嘤嘤……我就背我的孩子来给你看。”"
                    ],
                    "random_info": [],
                    "end": []
                },

                "actions": {
                    "default": {
                        "keys": [],
                        "text": [
                            "苍蝇：“嘤嘤嘤嘤……",
                            "“嘤嘤嘤嘤……",
                            "“嘤嘤嘤嘤嘤嘤嘤嘤嘤嘤嘤嘤嘤……",
                            "“把你的米饭分我一点，",
                            "“嘤嘤嘤嘤嘤……我就背我的孩子来给你看。”"
                        ],
                        "next_room": "after_3_days"
                    },
                    "chop": {
                        "keys": ['打', "啪", "拍", "打苍蝇", "打死苍蝇", "拍死苍蝇"],
                        "text": [
                            "你愤怒地驱赶着苍蝇，一不小心失去平衡，摔断了脖子。"
                        ],
                        "next_room": "death"
                    },
                    "shoot": {
                        "keys": ['喂', '喂苍蝇', '给苍蝇', '给苍蝇饭', '分苍蝇', '分给苍蝇', '分苍蝇饭', '分饭给苍蝇'],
                        "text": [
                            "苍蝇吃了一粒饭后，飞到了树下。",
                            "过了一会儿它从树下飞上来，背着一条蛆。",
                            "你知道老虎已经死了，于是放心地下了树。"
                        ],
                        "next_room": "a_cave"
                    }
                }
            },
            "a_cave": {
                "name": "一个山洞",
                "info": {
                    "start": [
                        "你往前走了一小段路，看到了一个山洞。",
                        "一群女子被关在这里。",
                        "一排肉晾在洞外。"
                    ],
                    "random_info": [],
                    "end": []
                },
                "actions": {
                    "default": {
                        "keys": [],
                        "text": [
                            "你在这里耽误得太久了，老虎的亲戚来串门了。",
                            "老虎的亲戚当然是老虎。",
                            "你被撕成了碎片。"
                        ],
                        "next_room": "death"
                    },
                    "correct question": {
                        "keys": ['问了一个问题', '生or熟', '生还是熟', "生吃还是熟吃", "生食还是熟食", "生肉还是熟肉", "吃生食还是熟食", "吃生肉还是熟肉", "问她们吃生的还是熟的", "问她们生吃还是熟吃", "问她们生食还是熟食", "问她们吃生食还是熟食", "问她们生肉还是熟肉", "问她们吃生肉还是熟肉"],
                        "text": [
                            "她们看着你，眼中闪耀着狂热的光。",
                            "“我们来这里很久了，吃的都是生肉。”",
                            "你抽出砍刀，把这些女子全都砍死了。"
                        ],
                        "next_room": "another_cave"
                    },
                    "release": {
                        "keys": ['释放她们', '放了她们', '打开山洞', "放她们走", "放她们自由"],
                        "text": [
                            "她们向你扑了过来。你猝不及防，被扑倒在地上。",
                            "你最后看到的情形是这群女人在撕咬着你的身体。"
                        ],
                        "next_room": "death"
                    },
                    "attack": {
                        "keys": ['攻击', '攻击她们', '砍她们', '砍死她们', '射死她们'],
                        "text": [
                            "你把她们全杀了。但是你不确定自己是不是应该这样做。",
                            "又饿又累加上迷惘，你迷了路。"
                        ],
                        "next_room": "death"
                    },
                    "ask for food": {
                        "keys": ['要吃的', '问她们要吃的', '饿', '有吃的吗', '问有吃的吗', '吃的', '食物', '饭'],
                        "text": [
                            "她们给了你一些吃的。",
                            "你觉得自己似乎发生了一些变化。",
                            "于是你决定不再离开，和她们生活在一起。"
                        ],
                        "next_room": "death"
                    }
                }
            },
            "another_cave": {
                "name": "另一个山洞",
                "info": {
                    "start": [
                        "你往前走了一小段路，看到了一个山洞。",
                        "一群女子被关在这里。",
                        "一排肉晾在洞外。"
                    ],
                    "random_info": [],
                    "end": []
                },
                "actions": {
                    "default": {
                        "keys": [],
                        "text": [
                            "你在这里耽误得太久了，老虎的亲戚来串门了。",
                            "老虎的亲戚当然是老虎。",
                            "你被撕成了碎片。"
                        ],
                        "next_room": "death"
                    },
                    "correct question": {
                        "keys": ['问了一个问题', '生or熟', '生还是熟', "生吃还是熟吃", "生食还是熟食", "生肉还是熟肉", "吃生食还是熟食", "吃生肉还是熟肉", "问她们吃生的还是熟的", "问她们生吃还是熟吃", "问她们生食还是熟食", "问她们吃生食还是熟食", "问她们生肉还是熟肉", "问她们吃生肉还是熟肉"],
                        "text": [
                            "她们看着你，眼神有些怪。",
                            "“我们来这里有一段时间了，吃的都是半生半熟。”",
                            "你抽出砍刀，把这些女子全都砍死了。"
                        ],
                        "next_room": "third_cave"
                    },
                    "release": {
                        "keys": ['释放她们', '放了她们', '打开山洞', "放她们走", "放她们自由"],
                        "text": [
                            "她们向你扑了过来。你猝不及防，被扑倒在地上。",
                            "你最后看到的情形是这群女人在撕咬着你的身体。"
                        ],
                        "next_room": "death"
                    },
                    "attack": {
                        "keys": ['攻击', '攻击她们', '砍她们', '砍死她们', '射死她们'],
                        "text": [
                            "你把她们全杀了。但是你不确定自己是不是应该这样做。",
                            "又饿又累加上迷惘，你迷了路。"
                        ],
                        "next_room": "death"
                    },
                    "ask for food": {
                        "keys": ['要吃的', '问她们要吃的', '饿', '有吃的吗', '问有吃的吗', '吃的', '食物', '饭'],
                        "text": [
                            "她们给了你一些吃的。",
                            "你觉得自己似乎发生了一些变化。",
                            "于是你决定不再离开，和她们生活在一起。"
                        ],
                        "next_room": "death"
                    }
                }
            },
            "third_cave": {
                "name": "又一个山洞",
                "info": {
                    "start": [
                        "你往前走了一小段路，看到了一个山洞。",
                        "一群女子被关在这里。",
                        "一排肉晾在洞外。"
                    ],
                    "random_info": [],
                    "end": []
                },
                "actions": {
                    "default": {
                        "keys": [],
                        "text": [
                            "你在这里耽误得太久了，老虎的亲戚来串门了。",
                            "老虎的亲戚当然是老虎。",
                            "你被撕成了碎片。"
                        ],
                        "next_room": "death"
                    },
                    "correct question": {
                        "keys": ['问了一个问题', '生or熟', '生还是熟', "生吃还是熟吃", "生食还是熟食", "生肉还是熟肉", "吃生食还是熟食", "吃生肉还是熟肉", "问她们吃生的还是熟的", "问她们生吃还是熟吃", "问她们生食还是熟食", "问她们吃生食还是熟食", "问她们生肉还是熟肉", "问她们吃生肉还是熟肉"],
                        "text": [
                            "她们答道，“我们刚来，吃的熟食。”",
                            "于是你释放了她们，她们给了你一包糯米饭后走了。"
                        ],
                        "next_room": "to_be_continue"
                    },
                    "release": {
                        "keys": ['释放她们', '放了她们', '打开山洞', "放她们走", "放她们自由"],
                        "text": [
                            "你释放了她们，她们很高兴，很快就全部离开了。",
                            "你感觉到很饿。搜索了一番，没有发现任何可以吃的东西。",
                            "你饿死了。"
                        ],
                        "next_room": "death"
                    },
                    "attack": {
                        "keys": ['攻击', '攻击她们', '砍她们', '砍死她们', '射死她们'],
                        "text": [
                            "你把她们全杀了。但是你不确定自己是不是应该这样做。",
                            "又饿又累加上迷惘，你迷了路。"
                        ],
                        "next_room": "death"
                    },
                    "ask for food": {
                        "keys": ['要吃的', '问她们要吃的', '饿', '有吃的吗', '问有吃的吗', '吃的', '食物', '饭'],
                        "text": [
                            "她们给了你一些吃的。",
                            "你觉得自己似乎发生了一些变化。",
                            "于是你决定不再离开，和她们生活在一起。"
                        ],
                        "next_room": "death"
                    }
                }
            }
        }
